LtyIntegrationTest/LtyCustomerLookUp/src/test/resources/data/json/Request_cusLookup_cusAcctMaint_wrongTier.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ent="http://www.macys.com/enterprise_services" xmlns:v11="http://loyalty.macys.com/schemas/loyalty.customer/CusRequest/v11_0" xmlns:v111="http://loyalty.macys.com/schemas/loyalty.customer/CusCommon/v11_0" xmlns:v112="http://loyalty.macys.com/schemas/loyalty.customer/MacysCommon/v11_0">
<soapenv:Header> 
<ent:requestor_info> 
<version>11.2</version> 
<client_id>Stores</client_id> 
<subclient_id>SPOS</subclient_id> 
</ent:requestor_info> 
</soapenv:Header> 
<soapenv:Body> 
<v11:CusAcctMaintReq> 
<v111:CustomerIdentifier> 
<v111:AccountType>L</v111:AccountType> 
<v111:AccountNumber>DynamicAccountNumber</v111:AccountNumber> 
</v111:CustomerIdentifier> 
<v11:TierInfo> 
<v111:ProgramCode>LTYMCY001</v111:ProgramCode> 
<v111:TierName>WRONG_TIER</v111:TierName> 
</v11:TierInfo> 
<v112:AssociateId>71234561</v112:AssociateId> 
<v112:Channel>ICMCS</v112:Channel> 
<v112:Division>71</v112:Division> 
</v11:CusAcctMaintReq> 
</soapenv:Body> 
</soapenv:Envelope>